//начало текста модуля

///////////////////////////////////////////////////
//Служебные функции и процедуры
///////////////////////////////////////////////////

&НаКлиенте
// контекст фреймворка Vanessa-Behavior
Перем Ванесса;
 
&НаКлиенте
// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;
 
&НаКлиенте
// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-Behavior.
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	//описание параметров
	//Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ДатаРожденияЧеловекаРавна(Парам01)","ДатаРожденияЧеловекаРавна","Допустим дата рождения человека равна 01.01.1990");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"НадоОпределитьЕгоВозрастВМесяцахНаДату(Парам01)","НадоОпределитьЕгоВозрастВМесяцахНаДату","И надо определить его возраст в месяцах на дату 02.01.1991");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВозрастЧеловекаСоставляетМесяцев(Парам01)","ВозрастЧеловекаСоставляетМесяцев","Тогда возраст человека составляет 12 месяцев");

	Возврат ВсеТесты;
КонецФункции
	
&НаСервере
// Служебная функция.
Функция ПолучитьМакетСервер(ИмяМакета)
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектСервер.ПолучитьМакет(ИмяМакета);
КонецФункции
	
&НаКлиенте
// Служебная функция для подключения библиотеки создания fixtures.
Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт
	Возврат ПолучитьМакетСервер(ИмяМакета);
КонецФункции



///////////////////////////////////////////////////
//Работа со сценариями
///////////////////////////////////////////////////

&НаКлиенте
// Процедура выполняется перед началом каждого сценария
Процедура ПередНачаломСценария() Экспорт
	
КонецПроцедуры

&НаКлиенте
// Процедура выполняется перед окончанием каждого сценария
Процедура ПередОкончаниемСценария() Экспорт
	
КонецПроцедуры



///////////////////////////////////////////////////
//Реализация шагов
///////////////////////////////////////////////////

&НаКлиенте
//Допустим дата рождения человека равна 01.01.1990
//@ДатаРожденияЧеловекаРавна(Парам01)
Процедура ДатаРожденияЧеловекаРавна(ДатаРождения) Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	//ВызватьИсключение "Не реализовано.";
	Контекст.Вставить("ДатаРождения", ДатаРождения);
КонецПроцедуры

&НаКлиенте
//И надо определить его возраст в месяцах на дату 02.01.1991
//@НадоОпределитьЕгоВозрастВМесяцахНаДату(Парам01)
Процедура НадоОпределитьЕгоВозрастВМесяцахНаДату(НаДату) Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	//ВызватьИсключение "Не реализовано.";
	Контекст.Вставить("НаДату", НаДату);
КонецПроцедуры

&НаКлиенте
//Тогда возраст человека составляет 12 месяцев
//@ВозрастЧеловекаСоставляетМесяцев(Парам01)
Процедура ВозрастЧеловекаСоставляетМесяцев(ВозрастПроверка) Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	//ВызватьИсключение "Не реализовано.";
	
	Возраст = ДомашнееЗадание.ПолучитьВозрастВМесяцах(Контекст.ДатаРождения, Контекст.НаДату);
	
	Если Возраст <> ВозрастПроверка Тогда
		ВызватьИсключение "Ошибка в расчетах. Возраст = " + Возраст;
	КонецЕсли;  	
	
КонецПроцедуры

//окончание текста модуля